from dataManager import *
from Helper import _dont_exists_filter, _exists_filter
load_dotenv()

app = Client(
    "NexViu",
    bot_token=os.getenv("BOT_TOKEN"),
    api_id=int(os.getenv("API_ID")),
    api_hash=os.getenv("API_HASH"),
    workdir="/app", 
    in_memory=False
)

db_connect = {
    "user": os.getenv("USERDB"),
    "password": os.getenv("PDB"),
    "host": os.getenv("HOSTDB"),
    "port": os.getenv("PORTDB"),
    "database": os.getenv("NAMEDB"),
}

db = Database(**db_connect)

ADMIN = '7979574575'

dont_exists_filter = filters.create(_dont_exists_filter)
exists_filter = filters.create(_exists_filter)

# --------- منوی اصلی ادمین ---------
admin_markup = ReplyKeyboardMarkup(
    [
        [KeyboardButton("🚀 ثبت تبلیغ جدید"), KeyboardButton("💸 نمایش تبلیغ و کسب درآمد")],
        [KeyboardButton("📢 کانال‌ها و گروه‌های من")],
        [KeyboardButton("👥 لیست کاربران"), KeyboardButton("🛑 حذف کاربران متخلف")],
        [KeyboardButton("📊 گزارش و آمار سیستم")],
        [KeyboardButton("💰 تنظیم هزینه تبلیغات"), KeyboardButton("💵 تنظیم درآمد منتشرکنندگان")],
        [KeyboardButton("💳 شارژ حساب / امور مالی")],
        [KeyboardButton("🆘 پشتیبانی و راهنما")],
        [KeyboardButton("💜 درباره NexViu"), KeyboardButton("🤝 همکاری با ما")],
    ],
    resize_keyboard=True
)

SITE = 'https://www.Nexviu.ir'

HI_MEMBER = HI_MEMBER = """🌟 **خوش‌آمدید به NexViu!**

NexViu یک سیستم کامل تبلیغاتی و درآمدزایی در تلگرام است — ساده، امن و قابل تنظیم برای هر نوع کسب‌وکار یا ناشر.

**🔹 امکانات اصلی**
• **تبلیغات هدفمند** — انتخاب دسته‌بندی و هدف‌گذاری دقیق  
• **زمان‌بندی هوشمند** — ارسال در تاریخ و ساعت دلخواه با دقت بالا  
• **کسب درآمد برای ناشران** — پرداخت به‌ازای انتشار و بازدید واقعی  
• **مدیریت مالی آسان** — شارژ و برداشت با پیگیری تراکنش‌ها  
• **گزارش‌ها و آمار دقیق** — خروجی قابل‌اشتراک و تحلیل عملکرد

**🔧 مدیریت و امنیت**
• کنترل کامل بر تأیید پست‌ها و حذف خودکار پس از رسیدن به هدف بازدید  
• جلوگیری از اسپم و سیستم اعطای پورسانت برای دعوت‌های موفق

**🚀 شروع سریع**
برای ادامه کافیست دستور زیر را ارسال کنید:
`/start`

اگر سوال یا مشکلی دارید، از دکمه‌ی پشتیبانی استفاده کنید — تیم پشتیبانی در دسترس است.

💜 با NexViu رشد کنید؛ تبلیغ هوشمند، درآمد واقعی.
"""